#name = 'Максим Леонид'

#print(name.split('м'))

my_list_1 = [2, 5, 8, 2, 12, 12, 4]
my_list_2 = [2, 7, 12, 3]

my_list_1dict = set(my_list_1)
my_list_2dict = set(my_list_2)

print(my_list_1dict)
print(my_list_2dict)
print(my_list_1 - my_list_2)
print(my_list_1dict - my_list_2dict)


for i in my_list_2:
    print(i)
    while i in my_list_1:
        my_list_1.remove(i)
print(my_list_1)

f = {1: 'один', 2: 'два', 3: 'три', 4: 'четыре', 5: 'пять',
     6: 'шесть', 7: 'семь', 8: 'восемь', 9: 'девять',10: 'десять',
     11: 'одиннадцать', 12: 'двенадцать', 13: 'тринадцать',
     14: 'четырнадцать', 15: 'пятнадцать', 16: 'шестнадцать',
     17: 'семнадцать', 18: 'восемнадцать', 19: 'девятнадцать',
     10: 'десять', 20: 'двадцать', 30: 'тридцать', 40: 'сорок',
     50: 'пятьдесят', 60: 'шестьдесят', 70: 'семьдесят',
     80: 'восемьдесят', 90: 'девяносто',
     100: 'сто', 200: 'двести', 300: 'триста',
     400: 'четыреста', 500: 'пятьсот', 600: 'шесттсот',
     700: 'семьсот', 800: 'восемьсот', 900: 'девятьсот',
     1000: 'отна тысяча', 2000:'две тысячи', 3000:'три тысячи',
     4000:'четыре тысячи', 5000:'пять тысяч',6000:'шесть тысяч',
     7000:'семь тысяч', 8000:'восемь тысяч', 9000:'девять тысяч'}

n = int(input('input number'))
n1 = n % 10
n2 = (n - n1) % 100
n3 = n - n2 - n1
print(n1, n2, n3)


if (n < 20):
    print (f.get(n))
elif (n >= 20 and n1 == 0) or (n >= 20 and n2 == 0):
    print(f.get(n))
elif (n > 20 and n < 100):
    print (f.get(n2) + ' ' + f.get(n1))
elif (n > 100):
    print('end')

print (n1, n2)
print(type(n1))

data = input('Введите дату в формате dd.mm.yyyy ')
data_list = data.split('.')

print(data_list)